Revit 2027 API
BuiltInFailures.GroupFailures.ReferencesOutsideGroupAreNotAllowed Property
 The elements you have selected for grouping contain dimensions or tags whose references are not all included in the selection being grouped and are not all included in a common model group. As a result, some of the selected elements have not been included in the new group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReferencesOutsideGroupAreNotAllowed { get; }
Public Shared ReadOnly Property ReferencesOutsideGroupAreNotAllowed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReferencesOutsideGroupAreNotAllowed {
	FailureDefinitionId^ get ();
}
static member ReferencesOutsideGroupAreNotAllowed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace